In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
df=pd.read_csv(r'Marks.csv')

In [5]:
df.head()

   S.N        Roll                        Name    T1  T2  End sem    TA Grades
0    1  BT20CSE001            ANIKET B AGRAWAL  22.0  17     24.0  18.0     AA
1    2  BT20CSE002          KATTA RAKESH REDDY  12.0  13     23.0  11.0     BC
2    3  BT20CSE003  CHIRAG RAJKUMAR BHANDAKKAR  20.0  15     18.0  18.0     BB
3    4  BT20CSE004     Tejas Rajendra Donadkar  22.5  17     23.0  17.0     AB
4    5  BT20CSE005  Utkarsh Sanjay Vishwakarma  23.0  17     22.5   4.0     BC

In [6]:
df.tail()

     S.N        Roll                   Name    T1  T2  End sem    TA Grades
186  187  BT20CSE207         Swapnil  Kabir  19.5  15     24.0  17.0     AB
187  188  BT19CSE101                NANDEEP   7.0  12      5.0   5.0     FF
188  189  Bt18cse039          Aatram Sujith   4.0  14     11.5   5.5     DD
189  190  BT20CSE096       VAIBHAV  GOKLANI   0.0   5      5.0   0.0     FF
190  191  BT20CSE195  SHUBHANGI ASHOK RASAL   0.0   9      1.0   0.0     FF

In [7]:
df.head(10)

   S.N        Roll                        Name    T1  T2  End sem    TA Grades
0    1  BT20CSE001            ANIKET B AGRAWAL  22.0  17     24.0  18.0     AA
1    2  BT20CSE002          KATTA RAKESH REDDY  12.0  13     23.0  11.0     BC
2    3  BT20CSE003  CHIRAG RAJKUMAR BHANDAKKAR  20.0  15     18.0  18.0     BB
3    4  BT20CSE004     Tejas Rajendra Donadkar  22.5  17     23.0  17.0     AB
4    5  BT20CSE005  Utkarsh Sanjay Vishwakarma  23.0  17     22.5   4.0     BC
5    6  BT20CSE006    Chaudhari Bhavesh Ishwar  14.0  15     23.5  16.0     BB
6    7  BT20CSE007              SATYAM  SHUKLA  22.0  17     23.5  18.0     AA
7    8  BT20CSE008   Vaidehi Manoj Mahyavanshi   8.0  14     24.0  15.0     BC
8    9  BT20CSE009             YATHARTH  ANAND  18.5  14     22.5  17.0     AB
9   10  BT20CSE010       Yogesh Jitendra Lolge  14.0  15     15.5  17.0     BB

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 191 entries, 0 to 190
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   S.N      191 non-null    int64
 1   Roll     191 non-null    object
 2   Name     191 non-null    object
 3   T1       191 non-null    float64
 4   T2       191 non-null    int64
 5   End sem  191 non-null    float64
 6   TA       191 non-null    float64
 7   Grades   191 non-null    object
dtypes: float64(3), int64(2), object(3)
memory usage: 12.1+ KB

In [10]:
df.describe()

            S.N          T1          T2     End sem          TA
count  191.0000  191.000000  191.000000  191.000000  191.000000
mean    96.0000   15.112565   13.890052   18.968586   14.782723
std     55.2811    5.958112    3.417210    5.570274    4.314744
min      1.0000    0.000000    0.000000    0.000000    0.000000
25%     48.5000   11.000000   12.000000   16.500000   13.000000
50%     96.0000   16.000000   14.000000   20.500000   17.000000
75%    143.5000   20.000000   17.000000   23.000000   18.000000
max    191.0000   26.000000   20.000000   26.500000   19.000000

In [11]:
df.shape

(191, 8)

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df['End sem']

0      24.0
1      23.0
2      18.0
3      23.0
4      22.5
       ...
186    24.0
187     5.0
188    11.5
189     5.0
190     1.0
Name: End sem, Length: 191, dtype: float64

In [14]:
df.T1  #only if the column name doesnt contain spaces

0      22.0
1      12.0
2      20.0
3      22.5
4      23.0
       ...
186    19.5
187     7.0
188     4.0
189     0.0
190     0.0
Name: T1, Length: 191, dtype: float64

In [15]:
df.End sem

SyntaxError: invalid syntax (<ipython-input-15-84843f7bc62b>, line 1)

In [16]:
df['S.N']

0        1
1        2
2        3
3        4
4        5
      ...
186    187
187    188
188    189
189    190
190    191
Name: S.N, Length: 191, dtype: int64

In [17]:
df['Grades'].value_counts()

BB    42
BC    39
AB    37
CC    22
AA    15
CD    15
FF    11
DD    10
Name: Grades, dtype: int64

In [18]:
df.T1.value_counts()

21.0    12
14.0    10
11.0     9
16.0     9
13.0     8
18.0     8
22.0     8
18.5     7
17.5     7
20.0     7
7.0      6
20.5     6
10.0     6
19.0     6
5.0      5
12.5     5
15.0     5
19.5     5
14.5     5
17.0     5
23.0     4
12.0     4
0.0      3
13.5     3
25.0     3
23.5     3
8.5      3
4.0      3
9.0      3
4.5      3
8.0      3
21.5     2
26.0     2
16.5     2
22.5     2
3.0      2
15.5     1
6.0      1
1.0      1
2.0      1
25.5     1
10.5     1
11.5     1
Name: T1, dtype: int64